# SQL and Python 2

### Background and Objetives
The goal of this challenge is to query fetch information from multiple table using JOIN.

<span style= 'color:grey'> Implement detailed_movies to get all the movie titles with the corresponding genre and director name.
This function should return a list of tuples like (title, genre, name). </span>

In [102]:
import pandas as pd
import sqlite3

In [105]:
conn = sqlite3.connect('data/movies.sqlite')
df = pd.read_sql_query("SELECT movies.title, movies.genres, directors.name FROM movies JOIN directors ON movies.director_id = directors.id ", conn)

In [107]:
df.head(5)

,title,genres,name
0,A Trip to the Moon,"Action,Adventure,Comedy",Georges Méliès
1,The Great Train Robbery,"Action,Crime,Short",Edwin S. Porter
2,The Birth of a Nation,"Drama,History,War",D.W. Griffith
3,Intolerance: Love's Struggle Throughout the Ages,"Drama,History",D.W. Griffith
4,The Cabinet of Dr. Caligari,"Fantasy,Horror,Mystery",Robert Wiene

<span style='color:grey'>Implement never_watched_movies to get the list of all movies which were released after their director passed away.
This function should return a list of movie titles.</span>

In [115]:
df_relesed_movies = pd.read_sql_query("SELECT movies.title FROM movies JOIN directors ON movies.director_id = directors.id WHERE (movies.start_year - directors.death_year) > 0 ORDER BY movies.title ", conn)

In [117]:
df_relesed_movies

                                    title
0                                    Cars
1                           Fantasia 2000
2                           Game of Death
3  The Many Adventures of Winnie the Pooh
4                            The Rescuers
5                                Waitress